[
  "Jump to ContentHomeGuidesAPI ReferenceChangelogDiscussionsLiveOps Statusv1.0GuidesMoon (Dark Mode)Sun (Light Mode)v1.0HomeGuidesAPI ReferenceChangelogDiscussionsLiveOps StatusOverviewSearchOzonetel CCaaSOverviewCloudAgent FeaturesVoiceOutbound VoiceDialer Data ManagementDID ManagementQueue ManagementRules ManagementCRM IntegrationsInbound VoiceCall Routing / IVRQueue ManagementRules ManagementDigitalOutbound DigitalOutbound SMS & WhatsAppInbound DigitalChat Routing / ICRQueue ManagementRules ManagementVideo LibraryVideo LibraryQuick Start GuideQuick Start GuideOzonetel IntegrationsIntegration with LeadsquaredIntegration with ZendeskIntegration with FreshSalesIntegration with FreshDeskIntegration with ZOHOIntegration with SalesforceMicrosoft Dynamic 365Integration with Fresh ChatIntegration with HubspotTroubleShooting guidesInbound Call Related IssuesUnable to connect to a DIDCalls are not connecting to DID when forwarded from TFN or moblieAgent is not receiving any calls(offline or online)Calls cannot be placed in ConferenceCalls have JitterCalls are getting disconnected automatically in queueFrequently asked questionsGeneralWhat is the limit for Outbound IVR call blast?What is the capacity / load Ozonetel can handle?What information is required to implement SSO integration with CloudAgent?Admin PortalWhat is the process to activate DND (Do Not Disturb) calling for a campaign?What are the steps for adding pause breaks for an agent?How can we change the admin password?Is it mandatory to prefix the phone number with 0?Can we add the office landline number to the phone numbers?What is \"Transfer Number\" feature, whose number it captures, and its use case?What types of call prioritisation features does Ozonetel offer?What is the difference between full & conversation recording and their use-cases.What are dispositions and its usesWhat is meant by ACW for unanswered calls?What part of the conversation does call recording include?Agent GuideOverviewGetting StartedUnderstanding Agent InterfaceHandling Voice CallsHandling Chat / Digital channelsOther FeaturesCross-Channel ConnectAdmin GuideOverviewLogging inDashboardBuilding a DashboardCampaignsInbound CampaignOutbound CampaignAdvanced RetriesIVR CampaignChat CampaignRestore a campaignOutbound campaign functionsScreen Pop ConfigCallback URL ConfigVoice Callback DetailsChat Callback DetailsTemplatesPeopleUser ProfileSub-UserAgentsGroupsConfigurationsIVR flowsManage NumbersLocationsSkillsPause ReasonsDispositionsMappingsSIP LocationsWhatsApp ConfigurationWhatsApp Switch Board in CloudAgentHolidaysBulk UpdateSettingsAdmin SettingsAgent SettingsIntegrationsSSO ConfigurationBroadcast MessagingLogoutLive ReportsOverviewGlossaryAgent Break DetailsAgent OverviewAgent Performance ReportDisposition Summary ReportAgent Login ReportCall Details ReportConference DetailsCustomer Hold Details ReportCustomer Interaction Details ReportDigital Channels DetailsIVR Feedback Details ReportIVR Hangup Details ReportMissed Call Details ReportPredictive Campaign Performance ReportPRI Utilization ReportSLA ReportSMS ReportSkill ReportVoice mail ReportPort Utilisation ReportOutbound Whatsapp ReportHow To Generate ReportsHistoric ReportsOverviewGlossaryHome DashboardDashboardDaily Call Summary ReportHourly Calls Analysis ReportInbound Call Analytics ReportOffline Phone Overview ReportOrganization Metrics ReportOrganization Overview ReportPerformance Dashboard ReportQueue Overview ReportSLA ReportCall Detail ReportsCall AnalyticsAudit Log ReportCall Backs ReportCampaign Productivity ReportConference DetailsCustomer Hold ReportDialer Count Details ReportHourly Call Details ReportHourly Phone Call ReportIVR Feedback ReportIVR Hangup Details ReportInbound Call Summary ReportMissed Call ReportOrganization Summary ReportOutbound Call Summary ReportPhone Productivity ReportPort Utilization ReportPredictive Campaign Performance ReportSkill Productivity ReportTransferred Calls ReportAgents ReportsAgent Break Details ReportAgent Call Summary ReportAgent Disposition ReportAgent Efficiency ReportAgent Login ReportAgent Productivity ReportAgent State Summary ReportHourly Active Agents ReportHourly Agent Call ReportHourly Agents Summary ReportPerformance Analytics ReportDigital ReportsChat Disposition Summary ReportDigital Detail ReportDynamic ReportsAgent Call Summary ReportDay Call Summary ReportDisposition Call Summary ReportCustom ReportsReports ListScheduler ReportsThresholdFiltersCampaign FilterAgent FilterCall Type FilterCampaign Type FilterSkill FilterLocation FilterCall Event FilterStatus FilterPhone Name FilterDisposition FilterDuration FilterTransferred FilterMode Type FilterHow to generate a ReportICRICR DesignerMasterclass SeriesIntroduction to IVR DesignerUsing APIs in IVR DesignerIntroduction to New DashboardsBot DesignerRelease NotesCloudAgent 2.0CloudAgent 2.1CloudAgent 2.2CloudAgent 2.4CloudAgent 2.5CloudAgent 3.0AppendixAppendixEscalation MatrixCustomer Support Escalation MatrixIndia NorthIndia SouthIndia WestInternationalPowered by Overview Suggest EditsOzonetel Contact Center as a Service (CCaaS) helps transform CX at every step of the customer journey. With Ozonetel CCaaS, you can rapidly deploy your contact center and ensure seamless operations, all while leveraging best-in-class features.",
  "How Ozonetel CCaaS works",
  "Ozonetel CCaaS operates through Amazon Web Services (AWS) and connects to internally managed Points of Presence (POPs). These POPs interface with SIP trunks, either provided by Ozonetel or owned by the contact center. Different services come with different pricing; for more details, click here.",
  "When a caller/customer dials a contact center, this call will be connected to the telecom POPs which sends information to the CCaaS logic which is in AWS, and then routed to the respective contact center and the available agents. This process applies to both inbound and outbound calls. Below is the system's architecture diagram.",
  "Mobile DID",
  "To increase call answer rates, especially for outbound campaigns, Ozonetel offers a Mobile DID solution, leveraging mobile numbers instead of landlines. The architecture for Mobile DID includes Mobile SIP trunk from a telecom operator,  below is the system's architecture diagram for the same.",
  "Updated 5 months ago Table of Contents",
  "How Ozonetel CCaaS works",
  "Mobile DID"
]